export const legal = `이용약관

제1조 (목적)
클라우드어스(이하 '회사')가 제공하는 디미고어스(이하 '서비스')를 이용해주셔서 감사합니다. 서비스를 이용함으로써 귀하는 본 약관에 동의하게 되므로 본 약관을 주의 깊게 읽어보시길 바랍니다.

제 2조 (정의)
① 본 약관에서 정하는 용어의 정의는 다음과 같습니다.

- 이용자’라 함은 회사와 본 약관에 동의하고 본 약관에 따라 서비스를 이용하는 사이트 회원을 말합니다.
- 비밀번호’란 이용자의 동일성 식별과 회원정보의 보호를 위하여 이용자가 설정하고 회사가 승인한 숫자와 문자의 조합을 말합니다.
- 오류’라 함은 이용자의 고의 또는 과실 없이 서비스가 본 약관 또는 이용자의 행동에 따라 이행되지 아니한 경우를 말합니다.

② 본 조 및 본 약관의 다른 조항에서 정의한 것을 제외하고는 관련법령에 정한 바에 따릅니다.

제3조 (약관의 명시 및 변경)
① 회사는 이용자가 서비스를 이용하기 전에 본 약관을 사이트에 게시하고 이용자가 본 약관의 중요한 내용을 확인할 수 있도록 합니다.

② 회사는 이용자의 요청이 있는 경우 전자문서의 전송(전자우편 혹은 디스코드을 이용한 전송을 포함합니다)의 방식에 의하여 본 약관의 사본을 이용자에게 교부합니다.

제4조 (데이터베이스 접근)
① 제 7조 혹은 관련 법령에 위법되는 행위가 발생하였을때 회사의 과반수가 확인하는 것에 동의 의사를 밝혔을 때에 확인 가능합니다.
② 디미고어스 책임자 및 관리자 전원이 확인하는 것에 동의 의사를 밝혔을 때 또한 확인이 가능합니다.
③ 개발 및 유지보수를 목적으로한 데이터 확인은 가능합니다.

제5조 (오류의 정정 등)
① 이용자는 서비스를 이용함에 있어 오류가 있음을 안 때에는 회사에 대하여 그 정정을 요구할 수 있습니다.

② 회사는 제1항의 규정에 따른 오류의 정정요구를 받은 때에는 이를 즉시 조사하여 처리한 후 정정요구를 받은 날부터 2주 이내에 그 결과를 이용자에게 알려 드립니다.

제6조 (회사의 책임)
① 회사는 접근매체의 위조나 변조로 발생한 사고(단, 회사가 접근매체의 발급 주체이거나 사용, 관리 주체인 경우), 계약체결 또는 거래지시의 전자적 전송이나 처리과정에서 발생한 사고로 인하여 이용자에게 손해가 발생한 경우에는 그 손해를 배상할 책임을 집니다.

② 회사는 제1항에도 불구하고 다음 각호의 경우에는 이용자에 대하여 손해배상책임을 지지 않습니다.

- 이용자가 접근매체를 제3자에게 대여하거나 사용을 위임하거나 양도 또는 담보 목적으로 제공하거나, 제3자가 권한없이 이용자의 접근매체를 이용하여 서비스를 이용 할 수 있음을 알았거나 알 수 있었음에도 불구하고 이용자가 자신의 접근매체를 누설 또는 노출하거나 방치한 경우

③ 회사는 이용자로부터의 거래지시가 있음에도 불구하고 천재지변, 회사의 귀책사유가 없는 정전, 화재, 통신장애 기타의 불가항력적인 사유로 처리 불가능하거나 지연된 경우로서 이용자에게 처리 불가능 또는 지연 사유를 통지한 경우(금융기관 또는 결제수단 발행업체나 통신판매업자가 통지한 경우를 포함합니다)에는 이용자에 대하여 이로 인한 책임을 지지 아니합니다.
④ 회사는 컴퓨터 등 정보통신설비의 보수점검, 교체의 사유가 발생하여 서비스의 제공을 일시적으로 중단할 경우에는 회사의 홈페이지를 통하여 이용자에게 중단 일정 및 중단 사유를 사전에 공지합니다.

제7조 (서비스 악용)
아래와 같은 이용은 악용하는 것으로 간주합니다.
1. 서비스를 정상적으로 이용할 수 없도록 만드는 디도스나 해킹(허가받지 않은 접근, 과도한 트래픽 발생 (봇넷,퍼져) 등).
2. 대한민국의 법령을 위반하는 행위.
3. 비하, 욕설과 같은 다른 사람에게 불쾌한 행위를 하는 자.
4. 다른 사람을 사칭하는 행위.
5. 본인의 명의가 아닌 다른 사람의 명의로 가입하는 행위.
6. 이 외 회사 혹은 관리자 과반 이상이 악용으로 간주하는 행위

본 약관은 2020년 2월 1일부터 시행합니다.
`;

export const privacy = `<클라우드어스>('https://dimigo.us'이하 '디미고어스')은(는) 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.

<클라우드어스>('디미고어스') 은(는) 회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.

○ 본 방침은부터 2020년 1월 1일부터 시행됩니다.


1. 개인정보의 처리 목적 <클라우드어스>('https://dimigo.us'이하 '디미고어스')은(는) 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 예정입니다.

가. 홈페이지 회원가입 및 관리

회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 만14세 미만 아동 개인정보 수집 시 법정대리인 동의 여부 확인 등을 목적으로 개인정보를 처리합니다.


나. 재화 또는 서비스 제공

서비스 제공, 콘텐츠 제공 등을 목적으로 개인정보를 처리합니다.




2. 개인정보 파일 현황

1. 개인정보 파일명 : 디미고어스 개인정보취급방침
- 개인정보 항목 : 휴대전화번호, 비밀번호, 로그인ID, 이름, 학력, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보
- 수집방법 : 홈페이지
- 보유근거 : 서비스 이용부정 방지
- 보유기간 : 지체없이 파기
- 관련법령 :




3. 개인정보의 처리 및 보유 기간

① <클라우드어스>('디미고어스')은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유,이용기간 내에서 개인정보를 처리,보유합니다.

② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.

1.<홈페이지 회원가입 및 관리>
<홈페이지 회원가입 및 관리>와 관련한 개인정보는 수집.이용에 관한 동의일로부터<지체없이 파기>까지 위 이용목적을 위하여 보유.이용됩니다.
-보유근거 : 서비스 이용부정 방지
-관련법령 :
-예외사유 :

4. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.

① 정보주체는 클라우드어스에 대해 언제든지 개인정보 열람,정정,삭제,처리정지 요구 등의 권리를 행사할 수 있습니다.
② 제1항에 따른 권리 행사는클라우드어스에 대해 개인정보 보호법 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 클라우드어스은(는) 이에 대해 지체 없이 조치하겠습니다.
③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
④ 개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.
⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.
⑥ 클라우드어스은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.



5. 처리하는 개인정보의 항목 작성

① <클라우드어스>('https://dimigo.us'이하 '디미고어스')은(는) 다음의 개인정보 항목을 처리하고 있습니다.

1<홈페이지 회원가입 및 관리>
- 필수항목 : 휴대전화번호, 비밀번호, 로그인ID, 이름, 학력, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보
- 선택항목 :




6. 개인정보의 파기<클라우드어스>('디미고어스')은(는) 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.

-파기절차
이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.

-파기기한
이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.

-파기방법
전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.



7. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항

① 클라우드어스 은 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠기(cookie)’를 사용합니다. ② 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다. 가. 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다. 나. 쿠키의 설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다. 다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.


8. 개인정보 처리방침 변경

①이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.



9. 개인정보의 안전성 확보 조치 <클라우드어스>('디미고어스')은(는) 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.

1. 해킹 등에 대비한 기술적 대책
<클라우드어스>('디미고어스')은 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.

2. 개인정보의 암호화
이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.

3. 접속기록의 보관 및 위변조 방지
개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.

4. 개인정보에 대한 접근 제한
개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.

5. 문서보안을 위한 잠금장치 사용
개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고 있습니다.

6. 비인가자에 대한 출입 통제
개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.
`;
